{
  "managers": [
    {
      "name": "Thomas Anzalone",
      "teamName": "Long Island Legion",
      "location": "New York City, NY",
      "upcomingSeasonNo": 7,
      "picCaption": "The most beautiful ginger anyone has ever seen",
      "bio": "Our resident ginger, Thomas Anzalone is among the most wholesome members not just of FTP, but the world at large. Thomas has been in FTP since its inception, and despite his reputation as a perennial contender and fierce competitor, has never brought home the coveted first place trophy. He is known for his patented \"Fuck RBs\" strategy and is an absolute shark on the waiver wire. Thomas resides in Orlando, FL with his much cooler girlfriend, kick ass rig, cushy government job, and way too many 5 and 7km eggs."
    },
    {
      "name": "Rohan Batra",
      "teamName": "West Coast Soyboys",
      "location": "Davie, FL",
      "upcomingSeasonNo": 4,
      "picCaption": "Damn he is rocking that scarf",
      "bio": "Rohan “The Historian” Batra made his FTP debut in Season 4 and became an instant fan favorite. Rohan has actually never made anyone upset ever and we love him very much. The fantasy gods, however, do not. Consistently finishing in the back half of the standings, Rohan’s Soyboys could really use a break. I think I can speak for everyone when I say that FTP is a better place when Rohan is competing for the title, and god willing he’ll claim his place on the trophy soon. Rohan enjoys being a weeb in his free time, watching anime, travelling to Japan, and even learning some Japanese. Rohan resides in Bellevue, Washington where he works for Microsoft and moonlights as the coolest guy I know."
    },
    {
      "name": "Henry Mancao",
      "teamName": "Broward Builders",
      "location": "Manila, Philippines",
      "upcomingSeasonNo": 6,
      "picCaption": "He has a real profile picture now I swear, I just haven't updated these pictures yet.",
      "bio": "Next to Neil, Henry is the league member who knows the least about the NFL. He's a numbers guy, plain and simple. Fantasy football, in Henry's eyes, can be reduced to standard deviations, expected values, and all that other statistics BS I forgot in school tbh. Despite this, Henry is a part of the very fabric that makes up our blessed league. While he struggled early on, in recent seasons he has proven himself to be a worthwhile competitor and a savvy trader. Time will tell if he manages to Moneyball his way to a league championship. Henry currently resides in Orlando, FL with 2 housemates, crippling medical debt, and the occasional food snapchat."
    },
    {
      "name": "UK Musa",
      "teamName": "Windy City Jayhawks",
      "location": "Seattle, WA",
      "upcomingSeasonNo": 5,
      "picCaption": "I will never look this cool",
      "bio": "Manager of the Windy City Jayhawks, Ukejeh Peter Ifeanyichkwu Musa has been leaving his mark on FTP Fantasy Football for the last five years. Musa famously debuted as the league’s worst team by a country mile, then followed up his embarrassing freshman season with a league championship the following year. Musa has remained one of the league’s stronger competitors since then, which has not gone unnoticed by the more senior members of the league. Despite his open antagonism toward league sweetheart Andrew Rubio, Musa is well-liked by all members of the league, with some describing him as “Bryan lite.” In 2018, Musa survived an assassination attempt by league commissioner Paulo Nascimento, when Musa was poisoned by one of the commissioner’s drugged brownies. Initially pronounced dead at the scene, Musa was resuscitated in the outdoor hallway of Bryan Petti’s apartment and has carried on as though nothing ever happened. Though his life has taken him all across the United States, Musa currently resides in Milledgeville, Georgia, where he earns his pay by doing some engineering work that involves paint. Shine on, you crazy diamond."
    },
    {
      "name": "Paulo Nascimento",
      "teamName": "San Francisco Wildfire",
      "location": "Sao Paulo, Brazil",
      "upcomingSeasonNo": 7,
      "picCaption": "This was a damn good burger",
      "bio": "Manager of the San Francisco Wildfire, Paulo “The Commish” Nascimento has been our fearless leader since the inaugural season. Much to Andrew’s shagrin, Paulo has been the most consistently successful member of FTP, making the playoffs every year, finishing no worse than 4th, and bringing home the title in 2018. Despite eyewitness accounts of Paulo snorting a concentrated powder made from Josh Gordon’s sweat, he has managed to evade any and all accusations of using performance enhancing drugs. Paulo must weather the awful existence of being a Patriots fan, and receives the lion’s share of league shit talking. Despite that, Paulo works hard to bring the league quality LM Notes (sometimes) and one day our very own website. Paulo’s hobbies include playing with his cat Keepo 2, sm0nking weeeeduuuh, and slowly moving farther and farther west. Paulo currently resides in the San Francisco area where he writes Flash games and pays a lot of money in rent."
    },
    {
      "name": "Anirudh Neti",
      "teamName": "Butters Bottom Bitches",
      "location": "Washington, D.C.",
      "upcomingSeasonNo": 3,
      "picCaption": "This image was generated by a neural network using thousands of pictures of real human faces. This is not a real face.",
      "bio": "Manager of the Butters Bottom Bitches, Anirudh “Frank ‘Anorith “Armaldo Xatu” Natu’ Hemmerstein” Neti is believed to be a highly-advanced artificial intelligence construct developed by Rohan Batra through his work in Microsoft’s national headquarters in Redmond, Washington. Though Neti claims to be a real person, and his claims are often corroborated by Batra, next to nothing is known about Neti, despite having played in FTP for the last three years, taking home a league championship in his debut season. Nobody in FTP knows what Neti looks like, nor have any of FTP’s members (aside from Batra, his programmer) interacted with Neti face-to-face. Despite campaigns led by some league members to expose Neti’s true identity as an artificial intelligence program, Neti ignores skeptics and focuses on the one thing he was programmed to do: succeed at fantasy football. Neti has been a force since entering the league, and it doesn’t appear he will be slowing down anytime soon. Nothing is known about Neti’s personal life, though this makes sense, as an AI would not be expected to have one. Be wary when interacting with Neti, as there is a likely chance all communications with the AI are being monitored by forces within and beyond our government."
    },
    {
      "name": "Bryan Petti",
      "teamName": "Hogtown Flyboys",
      "location": "Davie, FL",
      "upcomingSeasonNo": 7,
      "picCaption": "RIP Cocky Gators Fan Bryan",
      "bio": "Manager of the Hogtown Flyboys, Bryan “The Namesake” Petti has been an FTP icon since the league’s inception. He took home the inaugural title and has remained a competitive player ever since, though he has failed to make any deep playoff runs since his worldbeating debut seven years ago. Bryan is the league’s moral compass, often serving as the voice of reason and acting as a mediator when tensions and tempers flare. When he isn’t busy being a kind soul in the world of fantasy football, Petti partakes in equally wholesome activities during his spare time — his skills on the fantasy field are matched by his skills in the kitchen, his skills in the garden, and his skills in World of Tanks. In 2018, Petti served the league bowls of made-from-scratch pasta in his Stuart, Florida apartment. It was good pasta."
    },
    {
      "name": "Andrew Rubio",
      "teamName": "South Florida Storm",
      "location": "Miramar, FL",
      "upcomingSeasonNo": 7,
      "picCaption": "Handsome.",
      "bio": "Manager of the South Florida Storm, Andrew “Mumbimutale3” Rubio is one of only four remaining league members that can trace their FTP history back to the mysterious Season 1. Andrew has fielded some impressive squads over the years, but tragedy was never far behind. In Season 3, Andrew’s team ran roughshod through the league and into the championship game, but Aqib “Babwe ‘David Tyree’ Buttfuck” Shah struck him down in an act of sorcery that remains unexplained to this day. From such great heights came consecutive last place finishes and a mediocre 6th place last year. It’s hard to blame him, though, after suffering through the tragic loss of David Johnson in 2017 and the more hilarious hold-out of Le’Veon Bell in 2018. Andrew’s hobbies include enjoying craft beer, impeaching the commissioner, JoJo’s Bizarre Adventure, and telling people that they should watch JoJo’s Bizarre Adventure. Andrew hails from Miramar, Florida, where he spends his weekends lamenting why he ever cared about the Dolphins."
    },
    {
      "name": "Neil Seth",
      "teamName": "Utah Jazz Cabbage",
      "location": "Miami, FL",
      "upcomingSeasonNo": 2,
      "picCaption": "I just noticed the doggo has a matching hat and my life is complete.",
      "bio": "Neil [F R E S H] Seth is a relative newcomer to FTP, returning for his sophomore campaign. Last year he debuted with a bang, finishing last in the standings, but first in the categories of “being a lot cooler than that guy who taco’d” and “number of Julio Jones’ taken 2nd overall”. Neil was brought into our lives thanks to being a roommate of fellow league member Henry Mancao. Now Neil is kicking ass and taking names in Med School and we couldn’t be more proud. Neil’s hobbies include producing some dope lo-fi hip hop tracks (stay tuned for his first studio album) and having a brazilian girlfriend, which is pretty darn neat."
    },
    {
      "name": "Aqib Shah",
      "teamName": "Aventura Aardvarks",
      "location": "Aventura, FL",
      "upcomingSeasonNo": 6,
      "picCaption": "In case you were confused, he's the one in the red jacket and bowtie. Unfortunately.",
      "bio": "Manager of the Aventura Aardvarks, Aqib “Babwe “‘Prince Ali’” Shah has been an FTP mainstay since season two, enjoying his share of successes alongside seasons of relative mediocrity. In 2015, he cheesed his way to the league championship after defeating the heavy favorite Andrew Rubio in a contest the latter has yet to move on from. His relative lack of NFL knowledge is not to be underestimated, as he has somehow managed to autodraft his way to two FTP championships, the most in league history. When he isn’t somehow winning our league, Aqib enjoys spending his free time caring for animals, fucking bitches, and drinking alcohol — in no particular order."
    }
  ]
}